Tekla Open API Reference for Tekla Structures 2025
ReferenceModelObjectAttribute.AttributeTypeEnum Enumeration
 All the reference model object attribute types.
 Namespace: Tekla.Structures.Model.Collaboration
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum AttributeTypeEnum
Public Enumeration AttributeTypeEnum
Members
Member name | Value | Description
ATTRIBUTETYPE_INVALID | 0 |  The invalid attribute type.
ATTRIBUTETYPE_IFC2X3_PARAMETRICOBJECT_CSHAPEPROFILE | 3 |  The C-shape profile attribute type.
ATTRIBUTETYPE_IFC2X3_PARAMETRICOBJECT_CIRCLEHOLLOWPROFILE | 4 |  The circular and hollow profile attribute type.
ATTRIBUTETYPE_IFC2X3_PARAMETRICOBJECT_CIRCLEPROFILE | 5 |  The circular profile attribute type.
ATTRIBUTETYPE_IFC2X3_PARAMETRICOBJECT_ELLIPSEPROFILE | 6 |  The ellipse profile attribute type.
ATTRIBUTETYPE_IFC2X3_PARAMETRICOBJECT_ISHAPEPROFILE | 7 |  The I-shape profile attribute type.
ATTRIBUTETYPE_IFC2X3_PARAMETRICOBJECT_LSHAPEPROFILE | 8 |  The L-shape profile attribute type.
ATTRIBUTETYPE_IFC2X3_PARAMETRICOBJECT_RECTANGLEHOLLOWPROFILE | 9 |  The rectangular and hollow profile attribute type.
ATTRIBUTETYPE_IFC2X3_PARAMETRICOBJECT_RECTANGLEPROFILE | 10 |  The rectangular profile attribute type.
ATTRIBUTETYPE_IFC2X3_PARAMETRICOBJECT_TSHAPEPROFILE | 11 |  The T-shape profile attribute type.
ATTRIBUTETYPE_IFC2X3_PARAMETRICOBJECT_USHAPEPROFILE | 12 |  The U-shape profile attribute type.
ATTRIBUTETYPE_IFC2X3_PARAMETRICOBJECT_ZSHAPEPROFILE | 13 |  The Z-shape profile attribute type.
ATTRIBUTETYPE_PARAMETRICOBJECT_CUSTOMPROFILE | 14 |  The custom profile attribute type.
ATTRIBUTETYPE_PARAMETRICOBJECT_OBB | 29 |  The object bounding box (OBB) attribute type.
See Also
Reference
Tekla.Structures.Model.Collaboration Namespace